/*
* 登录名
* - 3-20位字符，包含小写字母、数字
* */
export const LOGIN_NAME_REG = /^[a-z\d]{3,20}$/


/*
* 用户名
* - 所有的中文字符（包括简体中文、繁体中文、日文汉字、韩文汉字等）
* - 所有英文字母（大小写）
* - 数字
* - 下划线
* - 中划线
* */
export const USER_NAME_REG = /^[\u4E00-\u9FA5a-zA-Z0-9_-]{4,16}$/;

// 手机号
export const PHONE_REG =
  /^[1](([3][0-9])|([4][01456789])|([5][012356789])|([6][2567])|([7][0-8])|([8][0-9])|([9][012356789]))[0-9]{8}$/;

/*
* 密码
* - 6-18位字符，包含大小写字母、数字、下划线
* */
export const PWD_REG = /^\w{6,18}$/;

// 邮箱
export const EMAIL_REG = /^\w+([-+.]\w+)*@\w+([-.]\w+)*\.\w+([-.]\w+)*$/;

// 6位验证码
export const CODE_SIX_REG = /^\d{6}$/;

// 4位验证码
export const CODE_FOUR_REG = /^\d{4}$/;

// URL
export const URL_REG =
  /(((^https?:(?:\/\/)?)(?:[-;:&=+$,\w]+@)?[A-Za-z0-9.-]+(?::\d+)?|(?:www.|[-;:&=+$,\w]+@)[A-Za-z0-9.-]+)((?:\/[+~%/.\w-_]*)?\??(?:[-+=&;%@.\w_]*)#?(?:[\w]*))?)$/;
